web/application/files/fedex/wsdl/ShipService_v12/ProcessShipmentRequest_ITAR.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v12="http://fedex.com/ws/ship/v12"><SOAP-ENV:Header/><SOAP-ENV:Body><v12:ProcessShipmentRequest><v12:WebAuthenticationDetail><v12:UserCredential><v12:Key></v12:Key><v12:Password/></v12:UserCredential></v12:WebAuthenticationDetail><v12:ClientDetail><v12:AccountNumber></v12:AccountNumber><v12:MeterNumber></v12:MeterNumber></v12:ClientDetail><v12:TransactionDetail><v12:CustomerTransactionId>ProcessShipmentRequest ITAR IP JP to ID</v12:CustomerTransactionId></v12:TransactionDetail><v12:Version><v12:ServiceId>ship</v12:ServiceId><v12:Major>12</v12:Major><v12:Intermediate>1</v12:Intermediate><v12:Minor>0</v12:Minor></v12:Version><v12:RequestedShipment><v12:ShipTimestamp>2012-01-05T12:34:56-06:00</v12:ShipTimestamp><v12:DropoffType>REGULAR_PICKUP</v12:DropoffType><v12:ServiceType>INTERNATIONAL_PRIORITY</v12:ServiceType><v12:PackagingType>YOUR_PACKAGING</v12:PackagingType><v12:PreferredCurrency>USD</v12:PreferredCurrency><v12:Shipper><v12:Contact><v12:PersonName>Sender_Name</v12:PersonName><v12:CompanyName>WAPISENDER-WBUS1100</v12:CompanyName><v12:PhoneNumber>9012704839</v12:PhoneNumber></v12:Contact><v12:Address><v12:StreetLines>Sender_Address_Line1</v12:StreetLines><v12:StreetLines>Sender_Address_Line2</v12:StreetLines><v12:City>MEMPHIS</v12:City><v12:StateOrProvinceCode>IT</v12:StateOrProvinceCode><v12:PostalCode>20098</v12:PostalCode><v12:CountryCode>IT</v12:CountryCode></v12:Address></v12:Shipper><v12:Recipient><v12:Contact><v12:PersonName>Recipient_Name</v12:PersonName><v12:CompanyName>CSCSWAPI-WBUS1100</v12:CompanyName><v12:PhoneNumber>9018549236</v12:PhoneNumber></v12:Contact><v12:Address><v12:StreetLines>Recipient_Address_Line1</v12:StreetLines><v12:StreetLines>Recipient_Address_Line2</v12:StreetLines><v12:City>RICHMOND</v12:City><v12:StateOrProvinceCode>TH</v12:StateOrProvinceCode><v12:PostalCode>10120</v12:PostalCode><v12:CountryCode>TH</v12:CountryCode></v12:Address></v12:Recipient><v12:ShippingChargesPayment><v12:PaymentType>SENDER</v12:PaymentType><v12:Payor><v12:ResponsibleParty><v12:AccountNumber></v12:AccountNumber><v12:Tins><v12:TinType>BUSINESS_STATE</v12:TinType><v12:Number>213456</v12:Number></v12:Tins><v12:Contact><v12:ContactId>12345</v12:ContactId><v12:PersonName>shriyash</v12:PersonName></v12:Contact></v12:ResponsibleParty></v12:Payor></v12:ShippingChargesPayment><v12:SpecialServicesRequested><v12:SpecialServiceTypes>INTERNATIONAL_TRAFFIC_IN_ARMS_REGULATIONS</v12:SpecialServiceTypes><v12:InternationalTrafficInArmsRegulationsDetail><v12:LicenseOrExemptionNumber>String</v12:LicenseOrExemptionNumber></v12:InternationalTrafficInArmsRegulationsDetail></v12:SpecialServicesRequested><v12:CustomsClearanceDetail><v12:DutiesPayment><v12:PaymentType>SENDER</v12:PaymentType><v12:Payor><v12:ResponsibleParty><v12:AccountNumber></v12:AccountNumber><v12:Tins><v12:TinType>BUSINESS_STATE</v12:TinType><v12:Number>213456</v12:Number></v12:Tins><v12:Contact><v12:ContactId>12345</v12:ContactId><v12:PersonName>shriyash</v12:PersonName></v12:Contact></v12:ResponsibleParty></v12:Payor></v12:DutiesPayment><v12:DocumentContent>NON_DOCUMENTS</v12:DocumentContent><v12:CustomsValue><v12:Currency>USD</v12:Currency><v12:Amount>100.00</v12:Amount></v12:CustomsValue><v12:CommercialInvoice><v12:TermsOfSale>FOB_OR_FCA</v12:TermsOfSale></v12:CommercialInvoice><v12:Commodities><v12:NumberOfPieces>1</v12:NumberOfPieces><v12:Description>ABCD</v12:Description><v12:CountryOfManufacture>US</v12:CountryOfManufacture><v12:Weight><v12:Units>LB</v12:Units><v12:Value>1.0</v12:Value></v12:Weight><v12:Quantity>1</v12:Quantity><v12:QuantityUnits>cm</v12:QuantityUnits><v12:UnitPrice><v12:Currency>USD</v12:Currency><v12:Amount>1.000000</v12:Amount></v12:UnitPrice><v12:CustomsValue><v12:Currency>USD</v12:Currency><v12:Amount>100.000000</v12:Amount></v12:CustomsValue></v12:Commodities><v12:ExportDetail><v12:ExportComplianceStatement>30.37(f)</v12:ExportComplianceStatement></v12:ExportDetail></v12:CustomsClearanceDetail><v12:LabelSpecification><v12:LabelFormatType>COMMON2D</v12:LabelFormatType><v12:ImageType>PNG</v12:ImageType><v12:LabelStockType>PAPER_7X4.75</v12:LabelStockType></v12:LabelSpecification><v12:RateRequestTypes>ACCOUNT</v12:RateRequestTypes><v12:PackageCount>1</v12:PackageCount><v12:RequestedPackageLineItems><v12:SequenceNumber>1</v12:SequenceNumber><v12:Weight><v12:Units>LB</v12:Units><v12:Value>20.0</v12:Value></v12:Weight><v12:Dimensions><v12:Length>12</v12:Length><v12:Width>12</v12:Width><v12:Height>12</v12:Height><v12:Units>IN</v12:Units></v12:Dimensions><v12:CustomerReferences><v12:CustomerReferenceType>CUSTOMER_REFERENCE</v12:CustomerReferenceType><v12:Value>string</v12:Value></v12:CustomerReferences></v12:RequestedPackageLineItems></v12:RequestedShipment></v12:ProcessShipmentRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
